Dynamo.Properties.Resources.RangePortDataAmountToolTip
Looks up a localized string similar to Amount of numbers in the sequence.

Dynamo.Properties.Resources.RangePortDataEndToolTip
Looks up a localized string similar to Number or letter to end the sequence at.

Dynamo.Properties.Resources.RangePortDataStartToolTip
Looks up a localized string similar to Number or letter to start the sequence at.

Dynamo.Properties.Resources.RangePortDataStepToolTip
Looks up a localized string similar to Space between numbers or letters.