Dynamo.UpdateManager.UpdateRequest
The UpdateRequest class encapsulates a request for
getting update information from the web.

Dynamo.UpdateManager.UpdateRequest.OnRequestCompleted
An action to be invoked upon completion of the request.
This action is invoked regardless of the success of the request.

Dynamo.UpdateManager.UpdateRequest.Data
The data returned from the request.

Dynamo.UpdateManager.UpdateRequest.Error
Any error information returned from the request.

Dynamo.UpdateManager.UpdateRequest.manager
UpdateManager instance that created this request.

Dynamo.UpdateManager.UpdateRequest.#ctor(System.Uri,Dynamo.UpdateManager.IUpdateManager)
The constructor.
path: Uri that needs to be read to get the update information.
manager: The update manager which is making this request.

Dynamo.UpdateManager.UpdateRequest.ReadResult(System.Object,System.Net.OpenReadCompletedEventArgs)
Event handler for the web client's requestion completed event. Reads
the request's result information and subsequently triggers
the UpdateDataAvailable event.
sender:
e: