Dynamo.UpdateManager.UpdateManager
This class provides services for product update management.

Dynamo.UpdateManager.UpdateManager.UpdateDownloaded
Occurs when RequestUpdateDownload operation completes.

Dynamo.UpdateManager.UpdateManager.ProductVersion
Obtains product version string

Dynamo.UpdateManager.UpdateManager.AvailableVersion
Obtains available update version string

Dynamo.UpdateManager.UpdateManager.UpdateFileLocation
Obtains downloaded update file location.

Dynamo.UpdateManager.UpdateManager.DownloadedUpdateInfo
Dirty patch: Set to the value of UpdateInfo once the new update installer has been
downloaded.

Dynamo.UpdateManager.UpdateManager.CheckNewerDailyBuilds
This flag is available via the debug menu to
allow the update manager to check for newer daily
builds as well.

Dynamo.UpdateManager.UpdateManager.ForceUpdate
Apply the most recent update, regardless
of whether it is newer than the current version.

Dynamo.UpdateManager.UpdateManager.Configuration
Returns the configuration settings.

Dynamo.UpdateManager.UpdateManager.CheckForProductUpdate(Dynamo.UpdateManager.IAsynchronousRequest)
Async call to request the update version info from the web.
This call raises UpdateFound event notification, if an update is
found.

Dynamo.UpdateManager.UpdateManager.UpdateDataAvailable(Dynamo.UpdateManager.IAsynchronousRequest)
Callback for the UpdateRequest's UpdateDataAvailable event.
Reads the request's data, and parses for available versions.
If a more recent version is available, the UpdateInfo object
will be set.
request: An instance of an update request.

Dynamo.UpdateManager.UpdateManager.GetLatestBuildFromS3(Dynamo.UpdateManager.IAsynchronousRequest,System.Boolean)
Get the file name of the latest build on S3
request:
Returns:

Dynamo.UpdateManager.UpdateManager.GetBuildTimeFromFilePath(System.String,System.String)
Get a build time from a file path.
filePath:
Returns: A DateTime or the DateTime MinValue.

Dynamo.UpdateManager.UpdateManager.GetVersionString(System.String,System.String)
Find the version string within a file name
by removing the base install name.
installNameBase:
filePath:
Returns: A version string like "x.x.x.x" or null if one cannot be found.

Dynamo.UpdateManager.UpdateManager.GetCurrentBinaryVersion
Get a binary version for the executing assembly
Returns: A BinaryVersion

Dynamo.UpdateManager.UpdateManager.GetBinaryVersionFromFilePath(System.String,System.String)
Get a BinaryVersion from a file path.
installNameBase: The base install name.
filePath: The path name of the file.
Returns: A BinaryVersion or null if one can not be parse from the file path.

Dynamo.UpdateManager.UpdateManager.IsDailyBuild(System.String,System.String)
Check if a file name is a daily build.
installNameBase:
fileName:
Returns: True if this is a daily build, otherwise false.

Dynamo.UpdateManager.UpdateManager.IsStableBuild(System.String,System.String)
Check if a file name is a stable build.
installNameBase:
fileName:
Returns: True if this is a stable build, otherwise false.

Dynamo.UpdateManager.UpdateManager.DownloadUpdatePackageAsynchronously(System.String,Dynamo.UpdateManager.BinaryVersion,System.String)
Async call to request downloading a file from web.
This call raises UpdateDownloaded event notification.
url: Web URL for file to download.
version: The version of package that is to be downloaded.
tempPath: Temp folder path where the update package
to be downloaded.
Returns: Request status, it may return false if invalid URL was passed.

Dynamo.UpdateManager.UpdateManager.DownloadSignatureFileAsynchronously(System.String,System.String)
Async call to download the signature file.
url: Signature file url for download.
tempPath: Temp folder path where the signature file
to be downloaded.
Returns:

Dynamo.UpdateManager.UpdateManager.CheckForProductUpdate(Dynamo.UpdateManager.IUpdateManager)
Checks for the product update by requesting for update version info
from configured download source path. This method will skip the
update check if a newer version of the product is already installed.
manager: Update manager instance using which product
update check nees to be done.