Dynamo.Scheduler.UpdateGraphAsyncTask.GetDownstreamNodes(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.ICollection{Dynamo.Graph.Nodes.NodeModel})
Call this method to recursively gather downstream nodes of a given node.
node: A NodeModel whose downstream nodes are to be gathered.
gathered: A list of all downstream nodes.