Dynamo.UpdateManager.UpdateManagerConfiguration
Defines Update Manager Configuration settings.

Dynamo.UpdateManager.UpdateManagerConfiguration.DownloadSourcePath
Defines download location for new installer

Dynamo.UpdateManager.UpdateManagerConfiguration.SignatureSourcePath
Defines location for signature file to validate the new installer.

Dynamo.UpdateManager.UpdateManagerConfiguration.CheckNewerDailyBuild
Defines whether to consider daily builds for update, default is false.

Dynamo.UpdateManager.UpdateManagerConfiguration.ForceUpdate
Defines whether to force update, default vlaue is false.

Dynamo.UpdateManager.UpdateManagerConfiguration.InstallerNameBase
Gets the base name of the installer to be used for upgrade.

Dynamo.UpdateManager.UpdateManagerConfiguration.ConfigFilePath
Return file path for the overriding config file.

Dynamo.UpdateManager.UpdateManagerConfiguration.#ctor
Default constructor

Dynamo.UpdateManager.UpdateManagerConfiguration.Load(System.String,Dynamo.UpdateManager.IUpdateManager)
Loads the configurations from given xml file.
filePath: Xml file path that contains configuration details.
updateManager:
Returns: UpdateManagerConfiguration

Dynamo.UpdateManager.UpdateManagerConfiguration.Save(System.String,Dynamo.UpdateManager.IUpdateManager)
Saves this configuration to a given file in xml format.
filePath: File path to save this configuration.
updateManager:

Dynamo.UpdateManager.UpdateManagerConfiguration.GetSettings(Dynamo.UpdateManager.IDynamoLookUp,Dynamo.UpdateManager.IUpdateManager)
Utility method to get the settings
lookUp: IDynamoLookUp instance
updateManager:
Returns:

Dynamo.UpdateManager.UpdateManagerConfiguration.TryGetConfigFilePath(System.String@)
Gets the update manager config file path.
filePath: Full path for the config file
Returns: True if file exists.