Dynamo.Graph.Nodes.NodeModel.IsInputNode
Input nodes are used in Customizer and Presets. Input nodes can be numbers, number sliders,
strings, bool, code blocks and custom nodes, which don't specify path.

Dynamo.Graph.Nodes.NodeModel.IsSelectedInput
Specifies whether an input node should be included in a preset.
By default, this field is set to true.

Dynamo.Graph.Nodes.NodeModel.WasInvolvedInExecution
Use to indicated if a node was involved in the most recent graph evaluation.

Dynamo.Graph.Nodes.NodeModel.RequestVisualUpdateAsync(Dynamo.Scheduler.IScheduler,Dynamo.Engine.EngineController,Dynamo.Visualization.IRenderPackageFactory,System.Boolean)
Call this method to asynchronously regenerate render package for
this node. This method accesses core properties of a NodeModel and
therefore is typically called on the main/UI thread.
scheduler: An IScheduler on which the task will be scheduled.
engine: The EngineController which will be used to get MirrorData for the node.
factory: An IRenderPackageFactory which will be used to generate IRenderPackage objects.
forceUpdate: Normally, render packages are only generated when the node's IsUpdated parameter is true.
By setting forceUpdate to true, the render packages will be updated.