Dynamo.UpdateManager.DynamoLookUp
Lookup for installed products

Dynamo.UpdateManager.DynamoLookUp.LatestProduct
Gets the version of latest product

Dynamo.UpdateManager.DynamoLookUp.GetDynamoVersion(System.String)
Locates DynamoCore.dll at given install path and gets file version
installPath: Dynamo install path
Returns: Dynamo version if valid Dynamo exists else null

Dynamo.UpdateManager.DynamoLookUp.GetDynamoInstallLocations
Gets all dynamo install path on the system by looking into the Windows registry.
Returns: List of Dynamo install path